{
  "basics": {
    "name": "Matthew Balaam",
    "label": "Programmer",
    "image": "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 538 538'%3E%3Cpath fill='%234CB1C5' d='M188.747 109.854L28.916 269.852l50.004 50.016 60.006-59.993v120.008l60.007-60v120.014l70.002 70.01v-340.03l-79.992 80.008z'/%3E%3Cpath fill='%23C57232' d='M458.955 219.906L408.951 269.9l50.004 50.011 50.01-49.993zM338.942 179.886l.022 80.031 40.007-40.042zM338.942 279.873l.022 80.028 40.007-40.04z'/%3E%3C/svg%3E",
    "email": "info@matthewbalaam.co.uk",
    "phone": "07730 953 486",
    "url": "matthewbalaam.co.uk",
    "summary": "Strong front-end developer able to adapt to full-stack within team projects. Agile learner with a curiousness toward innovative problem solving, and eagerness to update skills and knowledge to remain responsive to evolving technologies and market demands.\n\nMain skill set in JavaScript, CSS, HTML with experience using reactive frameworks and cross-browser knowledge.\n\nPrevious background in graphic design and multimedia with an eye for accuracy and the little details to make projects stand-out.\n\nThis CV is built as a bespoke React app, [review the code on Bitbucket](https://bitbucket.org/mattybalaam/matthewbalaam-co-uk).",
    "location": {
      "address": "Flat 3, 11 Medina Villas",
      "postalCode": "BN3 2RJ",
      "city": "Brighton and Hove",
      "countryCode": "GB"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "@matthewbalaam",
        "url": "twitter.com/matthewbalaam"
      },
      {
        "network": "GitHub",
        "username": "mattybalaam",
        "url": "github.com/MattyBalaam"
      }
    ]
  },
  "work": [
    {
      "name": "Pure360",
      "position": "Software Developer",
      "url": "pure360.com",
      "startDate": "2018-11-12",
      "endDate": "current",
      "highlights": ["Building a React SPA with Redux"]
    },
    {
      "name": "Simpplr",
      "position": "JavaScript Engineer",
      "url": "simpplr.com",
      "startDate": "2018-05-01",
      "endDate": "2018-11-10",
      "highlights": [
        "Building features on two React single page web apps in the corporate intranet sector. One an established product using React and Redux, and a more modern product using React with Apollo/GraphQL.",
        "Working in an Agile enviroment using elements borrowed from Scrum and Kanban methodologies"
      ]
    },
    {
      "name": "Filmstro",
      "position": "Software developer",
      "url": "filmstro.com",
      "startDate": "2017-07-21",
      "endDate": "2018-03-23",
      "highlights": [
        "Building cross-platform adaptive-music desktop app Filmstro Pro: A React/Redux app inside Electron communicating with a lower-level audio binary.",
        "Building new features, improving performance and fixing bugs. Providing input on UI and UX from prototype to final feature. Migrated build from Gulp to Webpack, writing automated end-to-end testing from specs by lead tester.",
        "Working on corporate website built using Laravel with the Voyager CMS, primarily helping with cross-browser consistency.",
        "Working using a Kanban Agile framework with daily stand-ups. Meeting with the product owner and 4 other devs to prioritise stories, tasks and bugs, sub-tasks then decided among devs."
      ]
    },
    {
      "name": "New Era Education Ltd.",
      "position": "Front-end developer",
      "url": "neweraed.co.uk",
      "startDate": "2013-07-07",
      "endDate": "2017-07-20",
      "highlights": [
        "Sole developer on all company public-facing websites using JavaScript, CSS (SASS/PostCSS) and webpack, with SilverStripe (PHP) providing an MVC framework (HTML templating, SQL, and an easy-to-use CMS for content editors.",
        "Working in a team on DB Primary, a safe, easy-to-use internet experience for pupils and teachers with a Java backend.",
        "Creating interactive learning materials and assessed games. Developing an easy-to-use activity builder tool allowing teachers to set their own quizzes and surveys."
      ]
    },
    {
      "name": "Freelance",
      "position": "Developer and designer",
      "url": "matthewbalaam.co.uk",
      "startDate": "2009-10-10",
      "endDate": "2013-07-07",
      "highlights": [
        "Building bespoke responsive websites with concise, accessible, standards compliant, device responsive HTML and CSS, JavaScript and PHP to work over all major browsers.",
        "Designing and developing interactive E-learning courses at all stages from art-direction to final built course.",
        "Creating a wide range of printed materials, emails and animated banners. Sourcing and liasing with print suppliers. "
      ]
    },
    {
      "name": "Newsquest Media",
      "position": "Graphic designer",
      "startDate": "2001-07-08",
      "endDate": "2009-10-10",
      "highlights": [
        "Design conception through to final artworking on a very broad range of print and digital projects. Working in a collaborative design team. Liaising with all departments, as well as external clients and printers."
      ]
    },
    {
      "name": "Archant Media",
      "position": "Artworker",
      "startDate": "1997-01-02",
      "endDate": "2001-07-07",
      "highlights": [
        "Mostly print-based work using applications including Illustrator, Photoshop, Fireworks and QuarkXPress in a time-critical daily newspaper work environment."
      ]
    }
  ],
  "education": [
    {
      "institution": "Southampton Solent University",
      "area": "Media and Cultural Studies",
      "studyType": "BA (Hons)",
      "startDate": "1993-09-15",
      "endDate": "1996-07-15",
      "summary": [
        "The practical half of this degree covered web design, television and radio production, desktop publishing, journalism and photography. These creative practices were informed by studying strands of critical theory with an emphasis on how these can assist the creative process."
      ]
    }
  ],
  "skills": [
    {
      "name": "Development",
      "keywords": [
        "JavaScript",
        "CSS and processors",
        "HTML",
        "React",
        "Redux",
        "GraphQL, Apollo",
        "TypeScript, ES2016, Babel",
        "Node",
        "Webpack",
        "PHP",
        "Git"
      ]
    }
  ]
}
